nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f83000evk/demo_apps/mc_pmsm/pmsm_enc/pin_mux.h
/*
    * Copyright 2024 NXP
    *
    * SPDX-License-Identifier: BSD-3-Clause
*/

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name GPIOF8 (number 6), LED_R
  @{ */
#define BOARD_INITPINS_LED_R_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_INITPINS_LED_R_PIN 8U              /*!<@brief GPIOF pin index: 8 */
#define BOARD_INITPINS_LED_R_PIN_MASK kGPIO_Pin8 /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name GPIOF9 (number 57), LED_G
  @{ */
#define BOARD_INITPINS_LED_G_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_INITPINS_LED_G_PIN 9U              /*!<@brief GPIOF pin index: 9 */
#define BOARD_INITPINS_LED_G_PIN_MASK kGPIO_Pin9 /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name GPIOF10 (number 56), LED_B
  @{ */
#define BOARD_INITPINS_LED_B_GPIO GPIOF           /*!<@brief GPIO device name: GPIOF */
#define BOARD_INITPINS_LED_B_PIN 10U              /*!<@brief GPIOF pin index: 10 */
#define BOARD_INITPINS_LED_B_PIN_MASK kGPIO_Pin10 /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name GPIOF11 (number 45), LED_Y
  @{ */
#define BOARD_INITPINS_LED_Y_GPIO GPIOF           /*!<@brief GPIO device name: GPIOF */
#define BOARD_INITPINS_LED_Y_PIN 11U              /*!<@brief GPIOF pin index: 11 */
#define BOARD_INITPINS_LED_Y_PIN_MASK kGPIO_Pin11 /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name GPIOC0 (number 3), EXTAL
  @{ */
#define BOARD_INITPINS_EXTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_EXTAL_PIN 0U              /*!<@brief GPIOC pin index: 0 */
#define BOARD_INITPINS_EXTAL_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name GPIOC1 (number 4), XTAL
  @{ */
#define BOARD_INITPINS_XTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_XTAL_PIN 1U              /*!<@brief GPIOC pin index: 1 */
#define BOARD_INITPINS_XTAL_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name GPIOF15 (number 46), SW2
  @{ */
#define BOARD_INITPINS_SW2_GPIO GPIOF           /*!<@brief GPIO device name: GPIOF */
#define BOARD_INITPINS_SW2_PIN 15U              /*!<@brief GPIOF pin index: 15 */
#define BOARD_INITPINS_SW2_PIN_MASK kGPIO_Pin15 /*!<@brief PORT pin mask */
                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
